// lab_3_2.cpp
// Савшак Арсен
// Лабораторна робота No 3.2
// Розгалуження, задане формулою: функція з параметрами
// Варіант 9

#include <iostream>
#include <cmath>

using namespace std;

int main(){
    double x; // вхідний аргумент
    double a; // вхідний параметр
    double b; // вхідний параметр
    double c; // вхідний параметр
    double F; // результат обчислення виразу

    cout << "a = "; cin >> a;
    cout << "b = "; cin >> b;
    cout << "c = "; cin >> c;
    cout << "x = "; cin >> x;

    // Розгалуження в скороченій формі

    if (a < 0 && x!= 0){
            F = a * pow(x, 2) + pow(b, 2) * x;
            cout << "Solve by 1 var" << endl; // Вивід того, яким варіантом було зроблено рішення
        }
    if (a > 0 && x == 0){
            F = x - a/(x-c);
            cout << "Solve by 2 var" << endl; // Вивід того, яким варіантом було зроблено рішення
        }
    if (!(a < 0 && x!= 0) && !(a > 0 && x == 0)){
            F = 1 + x/c;
            cout << "Solve by 3 var" << endl; // Вивід того, яким варіантом було зроблено рішення
        }
    cout << "1)F = '" << F << "'" << endl;

    // Розгалуження в повній формі

    if (a < 0 && x!= 0){
            F = a * pow(x, 2) + pow(b, 2) * x;
            cout << "Solve by 1 var" << endl; // Вивід того, яким варіантом було зроблено рішення
    }
    else {
            if (a > 0 && x == 0){
                F = x - a/(x-c);
                cout << "Solve by 2 var" << endl; // Вивід того, яким варіантом було зроблено рішення
        }
            else{
                F = 1 + x/c;
                cout << "Solve by 3 var" << endl; // Вивід того, яким варіантом було зроблено рішення
        }
    }
    cout << "2)F = '" << F << "'" << endl;

}
